""" модуль для доступу до вхідних даних та перегляду даних
"""



def get_clients():
    """отримує данні по клієнтам

    Returns:
        clients_list : список клієнтів
    """

    from_file = [
        "50;Картопля;кг;39",
        "60;Капуста;кг;32",
        "70;Цибуля;кг;40",
        "80;Мед;кг;450",
        "90;Часник;кг;250",
        "100;Яблука;кг;60",
        
        
     ]

    # накопичувач рядків
    clients_list = []

    for line in from_file:
        line_list = line.split(';')
        clients_list.append(line_list)

    return clients_list


def get_orders():
    """повертає список накладних

    Returns:
        from_file: список накладних
    """

    from_file = [
"50;36,6;35,7;38,3;38,3;2013"
"50;40,0;40,0;40,0;40,0;2014"
"50;40,0;45,0;45,0;43,0;2015"
"60;30,8;30,7;3,3;35,0;2013"
"60;35,0;35,4;36,0;36,5;2014"
"60;36,5;35,0;35,0;36,0;2015"
"70;50,8;45,0;49,2;51,6;2013"
"70;50,5;52,0;51,6;52,2;2014"
"70;52,2;55,0;54,3;55,0;2015"
"80;880,0;933,3;920,0;983,3;2013"
"80;990,0;995,0;1000,0;1000,0;2014"
"80;1000,0;1005,0;1005,0;1005,0;2015"
"90;265,0;264,2;288,2;305,0;2013"
"90;310,2;310,2;312,5;313,4;2014"
"90;313,4;315,2;316,5;316,5;2015"
"100;67,5;72,8;68,0;86,6;2013"
"100;86,5;86,5;88,2;88,2;2014"
"100;89,5;90,5;95,6;95,6;2015"
    ]

    # розбити строку на реквізити та перетворити формати (при потребі)
    orders_list = []    # список-накопичувач
    for line in from_file:
        line_list = line.split(';')
        line_list[3] = int(line_list[3])
        line_list[4] = int(line_list[4])
        orders_list.append(line_list)

    return orders_list





def show_clients(clients):
    """виводить список клієнтів за заданої умови

    Args:
        clients : сприсок клієнтів
    """

    client_code_from = input("З якого кода клієнта? ")
    client_code_to   = input("По який кода клієнта? ")
    
    for client in clients:
        if  client_code_from  <= client[0] <= client_code_to:
            print( "код: {:4} назва: {:18} адреса: {:20}".format(client[0], client[1], client[2]))


# clients = get_clients()
# show_clients(clients)

orders = get_orders()
for o in  orders:
    print(o)
